Revit 2026 API

# ViewScheduleCreateNoteBlock Method

---

Creates a note block.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ViewSchedule CreateNoteBlock(
	Document document,
	ElementId familyId
)
```
```vb
Public Shared Function CreateNoteBlock (
	document As Document,
	familyId As ElementId
) As ViewSchedule
```
```cpp
public:
static ViewSchedule^ CreateNoteBlock(
	Document^ document,
	ElementId^ familyId
)
```
```fsharp
static member CreateNoteBlock :
        document : Document *
        familyId : ElementId -> ViewSchedule
```

#### Parameters

document Document
     The document to which the new schedule will be added.
familyId ElementId
     The ID of the family whose elements will be included in the schedule.

#### Return Value

ViewSchedule The newly created schedule.

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. -or- familyId is not a valid family for a note block. |
| ArgumentNullException | A non-optional argument was null |
| ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| ModificationOutsideTransactionException | The document has no open transaction. |

A note block is a schedule of the Generic Annotations category that shows elements of a single family rather than all elements in the category.

#### Reference

ViewSchedule Class

Autodesk.Revit.DB Namespace